Name: Get new logon sessions
ID: SPL_New_Sessions
Description: Gets all logon events from Splunk and sends them to Neo4j
Author: FalconForce
Version: '1.0'
Info: |
  Gets all logon events from Splunk, filters out non-user logons, and creates a relationship between the computer and the user in Neo4j, 
  with the timestamp of the first logon event.
Active: true                                                # Enable to run this action
Debug: true                                                 # Enable to see query results in the console
SourcePlatform: Splunk                                      # Sentinel, Watchlist, Neo4j, CSV, MDE, Graph, Splunk
Query: |                                                    # Splunk index can be hardcoded or a variable set in the config.yml file
    index=%s EventCode=4624 earliest=-15m NOT(Logon_Type IN (3,7)) Security_ID ="S-1-5-21-*" 
    | eval UserName=mvindex(Account_Name,1), AccountSid=mvindex(Security_ID,1) 	
    | sort - _time 	
    | dedup ComputerName, UserName, AccountSid 	
    | table _time, ComputerName, UserName, AccountSid, Logon_Type
Targets:                                                   # Targets are the platforms that this action will push to (CSV, Neo4j, Sentinel, Wachlist, Slack, Teams, Splunk, Markdown)
  - Name: Neo4j
    Enabled: true
    Query: |
      WITH toUpper($Computer) as Computer, toUpper($TargetUserSid) as TargetUserSid, $Timestamp as Timestamp
      MATCH (x:Computer {name:Computer}) MATCH (y:User {objectid:TargetUserSid}) MERGE (x)-[r:HasSession]->(y) SET r.since=Timestamp SET r.source='falconhound'
    Parameters:
      Computer: ComputerName
      TargetUserSid: AccountSid
      Timestamp: _time