Name: New AAD user deletions
ID: SEN_AAD_New_User_Deletions
Description: Collects deleted AAD / EntraId user accounts created in the last 15 minutes and removes them from the graph.
Author: FalconForce
Version: '1.0'
Info: |-
Active: true                                               # Enable to run this action
Debug: false                                                 # Enable to see query results in the console
SourcePlatform: Sentinel                                    # Sentinel, Watchlist, Neo4j, CSV, MDE, Graph, Splunk
Query: |
  let timeframe = 15m;
  AuditLogs
  | where ingestion_time() >= ago(timeframe)
  | where OperationName =~ "Delete user" 
  | extend TargetResources=parse_json(TargetResources)
  | extend
      ObjectId = TargetResources.[0].id,
      userPrincipalName=TargetResources.[0].userPrincipalName
  | project ObjectId, userPrincipalName
Targets:                                                   # Targets are the platforms that this action will push to (CSV, Neo4j, Sentinel, Wachlist, Slack, Teams, Splunk, Markdown)
  - Name: Neo4j
    Enabled: true
    Query: |
      WITH toUpper($ObjectId) AS ObjectId
      MATCH (x:AZUser {objectid:ObjectId})
      DELETE x
    Parameters:
      ObjectId: ObjectId
