Name: Local Admin User Added to Machine
ID: SEN_Local_Admin_added
Description: Adds the AdminTo relation to a user which is added to the Administrators group on a machine.
Author: FalconForce
Version: '1.0'
Info: |-
Active: true                                               # Enable to run this action
Debug: true                                                 # Enable to see query results in the console
SourcePlatform: Sentinel                                    # Sentinel, Watchlist, Neo4j, CSV, MDE, Graph, Splunk
Query: |
  let timeframe = 7d;
  SecurityEvent
  | where EventID == 4732
  | where TargetSid == "S-1-5-32-544"
  | project TimeGenerated, Computer, TargetSid, SubjectUserSid
Targets:                                                   # Targets are the platforms that this action will push to (CSV, Neo4j, Sentinel, Wachlist, Slack, Teams, Splunk, Markdown)
  - Name: Neo4j
    Enabled: true
    Query: |
      WITH toUpper($SubjectUserSid) AS SubjectUserSid, $TimeGenerated AS Timestamp, toUpper($Computer) AS Computer
      MATCH (x:User {objectid:SubjectUserSid})
      MATCH (y:Computer {name: Computer})
      MERGE (x)-[r:AdminTo]->(y)
      SET r.source = 'falconhound', r.since = Timestamp
    Parameters:
      SubjectUserSid: SubjectUserSid
      Computer: Computer
      TimeGenerated: TimeGenerated