Name: AD new user creation events
ID: SEN_AD_New_User_Creations
Description: Collects new AD user accounts created in the last 15 minutes.
Author: FalconForce
Version: '1.0'
Info: |-
Active: true                                               # Enable to run this action
Debug: false                                                 # Enable to see query results in the console
SourcePlatform: Sentinel                                    # Sentinel, Watchlist, Neo4j, CSV, MDE, Graph, Splunk
Query: |
  let timeframe = 15m;
  SecurityEvent
  | where ingestion_time() >= ago(timeframe)
  | where EventID in (4720)
  | extend TargetDomainSid = substring(TargetSid, 0, strlen(TargetSid) - 5)
  | extend PrimaryGroup=strcat(TargetDomainSid,"-",PrimaryGroupId)
  | project TimeGenerated,TargetAccount,TargetSid=toupper(TargetSid),UserPrincipalName=toupper(UserPrincipalName),SamAccountName=toupper(SamAccountName),TargetDomainName,TargetDomainSid,PrimaryGroup
Targets:                                                   # Targets are the platforms that this action will push to (CSV, Neo4j, Sentinel, Wachlist, Slack, Teams, Splunk, Markdown)
  - Name: CSV
    Enabled: false
    Path: output/get_sessions_sentinel.csv
  # - Name: Sentinel
  #   Enabled: true
  - Name: Neo4j
    Enabled: true
    Query: |
      MERGE (x:Base {objectid:$TargetSid})
      SET x:User, x+={
      name: $UserPrincipalName,
      samaccountname: $SamAccountName,
      domainsid: $TargetDomainSid,
      domain: $TargetDomainName,
      displayname: $SamAccountName,
      distinguishedname: 'tbd',
      highvalue:False,
      falconhound:True,
      fhdate: $TimeGenerated
      }
      WITH x
      MATCH (y:Group) WHERE y.objectid = $PrimaryGroup
      MERGE (x)-[:MemberOf]->(y)
    Parameters:
      TargetSid: TargetSid
      UserPrincipalName: UserPrincipalName
      SamAccountName: SamAccountName
      TargetDomainSid: TargetDomainSid
      TargetDomainName: TargetDomainName
      TimeGenerated: TimeGenerated
      PrimaryGroup: PrimaryGroup
