Name: All remove events from AD groups
ID: SEN_AD_Group_Removal
Description: Gets all group removals from the Security logs, including local groups
Author: FalconForce
Version: '1.0'
Info: |-
Active: true                                               # Enable to run this action
Debug: false                                                 # Enable to see query results in the console
SourcePlatform: Sentinel                                    # Sentinel, Watchlist, Neo4j, CSV, MDE, Graph, Splunk
Query: |
  let timeframe = 15m;
  let targetEvent = dynamic([4729,4733,4757]); // 4733 Domain Local, 4729 >> Global, 4757 >> Universal
  SecurityEvent
  | where ingestion_time() >= ago(timeframe)
  | where EventID in (targetEvent)
  | where MemberName != '-'
  | project TargetAccount, TargetDomainName, GroupSid=TargetSid, MemberSid, Actor=SubjectUserName, TimeGenerated
Targets:                                                   # Targets are the platforms that this action will push to (CSV, Neo4j, Sentinel, Wachlist, Slack, Teams, Splunk, Markdown)
  - Name: Neo4j
    Enabled: true
    Query: |
      WITH $MemberSid AS MemberSid, $GroupSid AS GroupSid, $TimeGenerated AS Timestamp
      MATCH (u:User) WHERE u.objectid = MemberSid
      WITH u, GroupSid
      MATCH (g:Group) WHERE g.objectid = GroupSid
      MATCH (u)-[r:MemberOf]->(g)
      DELETE r
    Parameters:
      MemberSid: MemberSid
      GroupSid: GroupSid
      TimeGenerated: TimeGenerated