Name: Get logoff events to expire sessions
ID: SEN_Expire_Sessions_by_Logoff
Description: Gets all logoff events from Sentinel and syncs them to Neo4j
Author: FalconForce
Version: '1.0'
Info: |
  Gets all logoff events from Sentinel, filters out non-user logons, and creates a relationship between the computer and the user in Neo4j, 
  with the timestamp of the logoff event. It wil also remove the relationship between the computer and the user for the HasSession relationship.
Active: true                                                # Enable to run this action
Debug: false                                                 # Enable to see query results in the console
SourcePlatform: Sentinel                                    # Sentinel, Watchlist, Neo4j, CSV, MDE, Graph, Splunk
Query: |
    let timeframe = 15m;
    SecurityEvent
    | where ingestion_time() >= ago(timeframe)
    | where EventID in (4647)
    | where toupper(AccountType) == 'USER'
    | where TargetDomainName !in ('NT AUTHORITY','NT Service')
    | where isnotempty(TargetUserSid)
    | summarize Timestamp=arg_min(TimeGenerated,0) by Computer,TargetUserSid,TargetUserName,TargetDomainName
Targets:                                                   # Targets are the platforms that this action will push to (CSV, Neo4j, Sentinel, Wachlist, Slack, Teams, Splunk, Markdown)
  - Name: CSV
    Enabled: false
    Path: output/get_sessions_sentinel.csv
  # - Name: Sentinel
  #   Enabled: true
  - Name: Neo4j
    Enabled: true
    Query: |
      MATCH (x:Computer {name:$Computer})-[R:HasSession]- (y:User {objectid:$TargetUserSid})
      MATCH (x:Computer {name:$Computer}) MATCH (y:User {objectid:$TargetUserSid}) MERGE (x)-[r:HadSession]->(y) SET r.till=$Timestamp SET r.source='falconhound' DELETE R
    Parameters:
      Computer: Computer
      TargetUserSid: TargetUserSid
      Timestamp: Timestamp
