Name: New device registered in EntraID
ID: SEN_AAD_Device_Registration
Description: Gets all device registrations and their owners
Author: FalconForce
Version: '1.0'
Info: |-
Active: true                                               # Enable to run this action
Debug: false                                                 # Enable to see query results in the console
SourcePlatform: Sentinel                                    # Sentinel, Watchlist, Neo4j, CSV, MDE, Graph, Splunk
Query: |
  let timeframe = 15m;
  AuditLogs
  | where ingestion_time() >= ago(timeframe)
  | where OperationName contains "Register device"
  | mv-expand TargetResources
  | extend AdditionalDetails=parse_json(AdditionalDetails), InitiatedBy=parse_json(InitiatedBy)
  | mv-expand AdditionalDetails
  | where AdditionalDetails contains "Device Id"
  | extend deviceId=AdditionalDetails.value, ownerId=InitiatedBy.user.id
  | project TimeGenerated,deviceId, ownerId, TenantId
Targets:                                                   # Targets are the platforms that this action will push to (CSV, Neo4j, Sentinel, Wachlist, Slack, Teams, Splunk, Markdown)
  - Name: Neo4j
    Enabled: true
    Query: |
      WITH toUpper($ownerId) AS OwnerID, toUpper($deviceId) AS DeviceID, toUpper($TenantId) AS TenantID, $TimeGenerated AS TimeGenerated
      MERGE (d:AZDevice {objectid: DeviceID})
        ON CREATE SET d.tenantid = TenantID, d.lastseen = TimeGenerated, d.label = "AZBase"
      MERGE (u:AZUser {objectid: OwnerID})
        MERGE (u)-[r:AZOwns]->(d)
        ON CREATE SET r.added = TimeGenerated, r.source = 'falconhound'
    Parameters:
      ownerId: ownerId
      deviceId: deviceId
      TimeGenerated: TimeGenerated
      TenantId: TenantId