Name: AAD user removed from group
ID: SEN_AAD_User_Removed_from_Group
Description: Collects AAD / EntraId user accounts removed from a group.
Author: FalconForce
Version: '1.0'
Info: |-
Active: true                                               # Enable to run this action
Debug: false                                                 # Enable to see query results in the console
SourcePlatform: Sentinel                                    # Sentinel, Watchlist, Neo4j, CSV, MDE, Graph, Splunk
Query: |
  let timeframe = 15m;
  AuditLogs
  | where ingestion_time() >= ago(timeframe)
  | where OperationName contains "Remove member from group"
  | mv-expand TargetResources
  | extend TargetResources=parse_json(TargetResources)
  | extend ObjectId = TargetResources.id, userPrincipalName=TargetResources.userPrincipalName
  | where TargetResources.modifiedProperties contains "Group.ObjectID"
  | extend groupObjectId=trim('\"',tostring(TargetResources.modifiedProperties[0].oldValue))
  | project TimeGenerated,ObjectId,userPrincipalName,groupObjectId
Targets:                                                   # Targets are the platforms that this action will push to (CSV, Neo4j, Sentinel, Wachlist, Slack, Teams, Splunk, Markdown)
  - Name: Neo4j
    Enabled: true
    Query: |
      WITH toUpper($ObjectId) AS ObjectId, toUpper($userPrincipalName) AS UserPrincipalName, toUpper($groupObjectId) AS GroupObjectId
      MATCH (u:AZUser {objectid: ObjectId})-[r:AZMemberOf]->(g:AZGroup {objectid: GroupObjectId})
      DELETE r
    Parameters:
      ObjectId: ObjectId
      userPrincipalName: userPrincipalName
      groupObjectId: groupObjectId
