Name: Get hosts with ports exposed to the internet
ID: MDE_Publicly_exposed_machines
Description: Find Machines in MDE which have sensitive ports exposed on the internet.
Author: FalconForce
Version: '1.0'
Info: |-
Active: true                 # Enable to run this action
Debug: false                  # Enable to see query results in the console
SourcePlatform: MDE          # Sentinel, Watchlist, Neo4j, CSV, MDE, Graph, Splunk
Query: |
    let timeframe = 15m;
    DeviceNetworkEvents
    | where Timestamp > ago(timeframe)
    | where ActionType == "InboundInternetScanInspected"
    | where RemotePort in (3389,445,389,636,135,139,161,53,21,22,23,1433)
    | summarize LastSeen=arg_max(Timestamp, * ), PublicPorts=make_set(RemotePort) by DeviceId,DeviceName, PublicIP=RemoteIP
    | project LastSeen,PublicPorts,DeviceId,DeviceName,PublicIP,LocalIP
# Targets are the platforms that this action will push to (CSV, Neo4j, Sentinel, Wachlist, Slack, Teams, Splunk, Markdown)
Targets:
  - Name: Neo4j
    Enabled: true
    Query: |
      WITH toUpper($DeviceName) as DeviceName, $PublicPorts as PublicPorts
      MATCH (c:Computer {name:DeviceName}) SET c.exposed = true, c.ports = PublicPorts, c.exposedSince = $LastSeen
    Parameters:
      DeviceName: DeviceName
      PublicPorts: PublicPorts
      LastSeen: LastSeen
  - Name: Watchlist
    Enabled: true
    WatchlistName: FH_MDE_Exposed_Machines
    DisplayName: MDE Exposed Machines
    SearchKey: DeviceName
    Overwrite: false